In [1]:
import pandas as pd

In [2]:
date_list = [{'yyyy-mm-dd' : '2000-06-27'},
             {'yyyy-mm-dd' : '2002-09-24'},
             {'yyyy-mm-dd' : '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [3]:
def extract_year(column):
    return column.split("-")[0] #대쉬 분리하여 첫 인자를 분리해서 리턴

In [4]:
df['year']= df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [5]:
def get_age(year, current_year) :
    return current_year - int(year)

In [7]:
df['age']= df['year'].apply(get_age, current_year= 2021)
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   21
1  2002-09-24  2002   19
2  2005-12-20  2005   16

In [8]:
def get_introduce(age, prefix, suffix):
    return prefix+ str(age)+ suffix

In [11]:
df['introduce']= df['age'].apply(get_introduce, prefix= ' I am ', suffix = ' years old')
df

   yyyy-mm-dd  year  age           introduce
0  2000-06-27  2000   21   I am 21 years old
1  2002-09-24  2002   19   I am 19 years old
2  2005-12-20  2005   16   I am 16 years old

In [18]:
def get_introduce_2(row):
    return "I was born in "+ str(row.year) + ", my age is "+ str(row.age) + "."

In [22]:
df.introduce= df.apply(get_introduce_2, axis=1)
df

   yyyy-mm-dd  year  age                          introduce
0  2000-06-27  2000   21  I was born in 2000, my age is 21.
1  2002-09-24  2002   19  I was born in 2002, my age is 19.
2  2005-12-20  2005   16  I was born in 2005, my age is 16.

## map apply map 함수

In [25]:
date_list = [{'date' : '2000-06-27'},
             {'date' : '2002-09-24'},
             {'date' : '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [26]:
def extract_year(date):
    return date.split("-")[0]

In [30]:
df['year']= df['date'].map(extract_year)
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [44]:
job_list = [{'age': 20, 'job': 'student'},
         {'age': 30, 'job': 'developer'},
         {'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [45]:
df.job= df.job.map({'student': 1, 'developer': 2, 'teacher': 3})

In [46]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [48]:
x_y = [{'x': 5.5, 'y': -5.6, 'z': -1.1},
         {'x': -5.2, 'y': 5.5, 'z':-2.2},
         {'x': -1.6, 'y': -4.5, 'z': -3.3}]
df = pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [49]:
import numpy as np

In [51]:
df= df.applymap(np.around) #반올림
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [54]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

#### unique() gives you unique values of the column in list format

In [53]:
print( df.job.unique() ) #무슨 항목 존재하는지 확인

['teacher' 'student' 'developer' 'dentist' 'lawyer' 'banker'
 'basketball player']

#### value_counts() gives you the number of item for each unique columns

In [55]:
df.job.value_counts()

teacher              8
student              5
banker               2
lawyer               2
basketball player    1
dentist              1
developer            1
Name: job, dtype: int64